In [1]:
print("this is python jupyter")

this is python jupyter

In [2]:
for n in range(1,11):
    print(n)

1
2
3
4
5
6
7
8
9
10

In [3]:
import pandas as pd

In [5]:
df=pd.DataFrame({
    "name":["ajit","karthik","sachin"],
    "city":["mumbai","pune","nashil"]
})

In [6]:
df

      name    city
0     ajit  mumbai
1  karthik    pune
2   sachin  nashil

In [7]:
df["city"]

0    mumbai
1      pune
2    nashil
Name: city, dtype: object

In [8]:
df["name"]

0       ajit
1    karthik
2     sachin
Name: name, dtype: object

In [9]:
wheaher_data = [(1,32,6,"rain"),(2,35,5,"sunny"),(3,38,5,"sunny"),(4,31,5,"snow")]

In [10]:
wheaher_data

[(1, 32, 6, 'rain'),
 (2, 35, 5, 'sunny'),
 (3, 38, 5, 'sunny'),
 (4, 31, 5, 'snow')]

In [11]:
df1= pd.DataFrame(data=wheaher_data, columns=["day","temperature","windspeed","event"])

In [12]:
df1

   day  temperature  windspeed  event
0    1           32          6   rain
1    2           35          5  sunny
2    3           38          5  sunny
3    4           31          5   snow

In [14]:
df2=pd.read_csv("data")

In [15]:
df2

      company  year  price
0  citiustech  2010   1000
1  citiustech  2011   2000
2   microsoft  2010   2000
3   microsoft  2011   3000

In [16]:
df2[df2["year"] == 2010]

      company  year  price
0  citiustech  2010   1000
2   microsoft  2010   2000

In [17]:
df2

      company  year  price
0  citiustech  2010   1000
1  citiustech  2011   2000
2   microsoft  2010   2000
3   microsoft  2011   3000

In [20]:
df3 = df2[df2["year"] == 2010]

In [21]:
df3

      company  year  price
0  citiustech  2010   1000
2   microsoft  2010   2000

In [23]:
df[0:2] #slicing

      name    city
0     ajit  mumbai
1  karthik    pune

In [25]:
df2["company"][2]

'microsoft'

In [27]:
df5=pd.read_excel("emps.xlsx")

In [28]:
df5

   EmpNo EmpName       Dept  Salary
0      1    amit    finance    4000
1      2    anil      sales    5000
2      3   sunil    finance    6000
3      4    ajit      sales    5000
4      5  sachin    finance    7000
5      6   rahul        dev    8000
6      7  sammer  marketing    2000